{
  "content": "标题: DBS Marketplace: Travel, Home, Car, Health, Education Online\n网址: https://www.dbs.com.sg/personal/marketplace/\n内容:\nBack to DBS Our Marketplaces Login to Marketplace Fast approval and low interest rates only with DBS Car Loan Explore now Register now Live Wonderful with Rewarding Travels Learn More Feel truly at home with DBS Home Loan Learn More 20% off: CareShield Life Supplement Learn more Fast approval and low interest rates only with DBS Car Loan Explore now Register now Live Wonderful with Rewarding Travels Learn More Feel truly at home with DBS Home Loan Learn More 20% off: CareShield Life Supplement Learn more Fast approval and low interest rates only with DBS Car Loan Explore now 1 2 3 4 5 Explore Marketplace Deals For You Home Car Health DBS Marketplace Exclusive Remit and Win tickets to the USA with STARLUX New to DBS Remit? Earn up to S$60 cashback with promo code NEWREMIT. Learn more Register Now Travel Insurance for you TravellerShield Plus Get coverage of up to S$1,000,000 for unexpected medical expenses abroad with our ongoing promotions! Learn More Feel truly at home with DBS Home Loan Celebrate SG60 with up to S$5,300 in rewards. Apply by 31 October 2025. Learn more Health and Protection Plan Don’t miss out on 20% off Lifetime Premium Enjoy 20% off when you sign up for CareShield Life Supplement with the code “LTC1”. Sign up now Explore More Card Privileges More deals for you Explore now 1 2 What's popular Exchange 11 currencies via digibank without FX fees Exclusive Offer when you apply for a DBS/POSB Credit Card Enjoy DBS Green Car Loan at 2.48% p.a. (EIR 4.65% p.a.) Renovation Loans from as low as 4.88% p.a (EIR 5.96% p.a.) Personal loans from as low as 1.99% p.a. (EIR 4.17% p.a.) Celebrate SG60 and get up to S$60 cashback with DBS Remit Resources Just For You Secure the Perfect Home For Your Family! Use DBS MyHome Planner on Home Marketplace to start planning your finances! Your future beyond borders with DBS Education Guide Let us guide you to the right financial products for you or your child’s education abroad Thinking about owning a family car? We've got you! Use DBS Car Budget Calculator to find out your affordability and enjoy competitive rates! Secure the Perfect Home For Your Family! Use DBS MyHome Planner on Home Marketplace to start planning your finances! Your future beyond borders with DBS Education Guide Let us guide you to the right financial products for you or your child’s education abroad Thinking about owning a family car? We've got you! Use DBS Car Budget Calculator to find out your affordability and enjoy competitive rates! Secure the Perfect Home For Your Family! Use DBS MyHome Planner on Home Marketplace to start planning your finances! 1 2 3 Terms & Conditions Privacy Policy Fair Dealing Commitment Become a Partner © 2025 DBS Bank Ltd Co. Reg No 196800306E",
  "metadata": {
    "source_type": "website",
    "source_file": "https://www.dbs.com.sg/personal/marketplace/",
    "content_type": "web_content",
    "processing_time": "2025-10-20 18:14:11",
    "title": "DBS Marketplace: Travel, Home, Car, Health, Education Online",
    "url": "https://www.dbs.com.sg/personal/marketplace/"
  }
}