{
  "content": "标题: DBS Singapore - Asia's Safest Bank & Trusted Banking Partner\n网址: https://www.dbs.com.sg/personal/default.page\n内容:\nDBS Scam Defence ACT to get the upper hand over scammers. Get S$60 cash rebate with MP3 When you split at least S$1,500 of purchases into a 12 or 24-month instalment. Fly to your dream USA city on us Simply register & remit to win round-trip STARLUX tickets. Switch for a Sweet S$300 Payday Bonus! Simply switch your salary credit to DBS to enjoy. Earn up to 2.5% p.a. on first S$100,000 Simply open a new Multiplier account, credit your salary and spend with us! Travel Smarter with DBS Visa Debit Card Go beyond zero FX fees with up to 11 foreign currencies and more travel deals! Find what you need Featured CIO Insights Funds Banking for Seniors Live Wonderful with 1-for-1 dining deals Everyone’s rewardedwith DBS yuu Card. Multiplier is simpler than ever for all! Retirement digiPortfolio Learn Manage your money better with our how-to guides and tips Is lump-sum investing or DCA better for you? Should I retire during market uncertainty? Understanding Multi-pay Critical Illness Insurance Your quick guide to get started with Reits Travel light with the right insurance plan A Savings Plan for your First Home LiveBetter for a sustainable world Our Green Solutions make it easy and rewarding to go green every day. DBS LiveBetter Sustainability at DBS Go Green with DBS Green Car Loan Quick Tools Get the numbers you need here Overseas Funds Transfer & Remit More from DBS Discover a different side A world of effortless banking with DBS digibank App Insights Start investing with DBS Treasures Unlock global investment opportunities and be rewarded when you start with us. Deposit Insurance Scheme SDIC Consumer Guides Useful Links Others Need Help? Help & Support Portal Phone - 1800 111 1111 Get In Touch with Us Markets",
  "metadata": {
    "source_type": "website",
    "source_file": "https://www.dbs.com.sg/personal/default.page",
    "content_type": "web_content",
    "processing_time": "2025-10-20 18:14:11",
    "title": "DBS Singapore - Asia's Safest Bank & Trusted Banking Partner",
    "url": "https://www.dbs.com.sg/personal/default.page"
  }
}